SOAP/src/test/resources/postTable.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.soap.tks.it.p.lodz.pl">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:postTableRequest>
                <gs:id>test1</gs:id>
                <gs:price>12.1</gs:price>
                <gs:number>15</gs:number>
                <gs:numOfPeople>4</gs:numOfPeople>
        </gs:postTableRequest>
    </soapenv:Body>
</soapenv:Envelope>